Repository: rmraya/TMXEditor
Catalog: docs/i18n/tmxeditor_es.ditamap.tmx
Source language: en
Languages: es

source: A new file is displayed in the editing window.
es: Se muestra un nuevo archivo en la ventana de edición.

source: To add new entries, click on the Insert Translation Unit button on the top toolbar, or select Edit Insert Translation Unit in main menu.
es: Para agregar nuevas entradas, haga clic en el botón Insertar Unidad de Traducción en la barra de herramientas superior o seleccione Editar Insertar Unidad de Traducción en el menú principal.

source: Edit cells as explained in Editing an Existing File section.
es: Edite las celdas como se explica en la sección Editar un Archivo Existente .

source: To save the changes made to the file, select File Save option ([ Ctrl+S ] on Windows/Linux, [ Cmd+S ] on macOS) in main menu, or click the Save button on the top toolbar.
es: Para guardar los cambios en el archivo TMX, seleccione Archivo Guardar en el menú principal ([ Ctrl+S ] en Windows/Linux, [ Cmd+S ] en macOS) o haga clic en el botón Guardar de la barra de herramientas superior.

source: Use the dialog that appears to indicate the name and location where the new TMX file will be saved.
es: Utilice el cuadro de diálogo que aparece para indicar el nombre y la ubicación donde se guardará el nuevo archivo TMX.

source: Follow these steps to convert a TMX file to an Excel spreadsheet.
es: Siga estos pasos para convertir un archivo TMX a una planilla Excel.

source: Microsoft Excel files provide a common way to exchange tabular data. TMXEditor is able to export TMX text data, without inline tags, to .xlsx files.
es: Los archivos de Microsoft Excel proporcionan una forma común de intercambiar datos tabulares. TMXEditor es capaz de exportar datos en formato TMX a archivos .xlsx sin incluir etiquetas.

source: An Excel worksheet on Office 365 and newer versions of Microsoft Office such as Excel 2019, 2016, 2013, 2010 and 2007 can contain maximum 1,048,576 rows and 16,384 columns. Older versions contained a limit of maximum 65,536 rows and 256 columns.
es: Una hoja de cálculo de Excel en Office 365 y versiones más recientes de Microsoft Office, como Excel 2019, 2016, 2013, 2010 y 2007, puede contener un máximo de 1.048.576 filas y 16.384 columnas. Las versiones anteriores contenían un límite máximo de 65.536 filas y 256 columnas.

source: Open the TMX file that you want to export.
es: Abra el archivo TMX que desea exportar.

source: In main menu, select File Export as Excel File... .
es: En el menú principal, seleccione Archivo Exportar Archivo Excel... .

source: Use the dialog that appears to locate and select the generated Excel file.
es: Utilice el cuadro de diálogo que aparece para localizar y seleccionar el archivo Excel que desea generar.

source: Export as TAB Delimited File
es: Exportar Como Archivo Delimitado por TAB

source: Follow these steps to convert a TMX file to TAB delimited format that can be reviewed using Microsoft Excel or similar applications.
es: Siga estos pasos para convertir un archivo TMX a formato delimitado por TAB que pueda ser revisado usando Microsoft Excel o aplicaciones similares.

source: Tab-delimited files are plain text files used for storing data in a tabular structure, e.g., database table or spreadsheet data, and a way of exchanging information between databases. Each record in the table is one line of the text file and entries are separateed by a TAB character.
es: Los archivos delimitados por tabuladores son archivos de texto sin formato que se utilizan para almacenar datos en una estructura tabular, por ejemplo, datos de tablas de bases de datos u hojas de cálculo, y una forma de intercambiar información entre bases de datos. Cada registro de la tabla es una línea del archivo de texto y las entradas están separadas por un carácter TAB.

source: In main menu, select File Export as TAB Delimited File... .
es: En el menú principal, seleccione Archivo Exportar Como Archivo Delimitado por TAB... .

source: Use the dialog that appears to locate and select the file where to save the TAB delimited version.
es: Utilice el cuadro de diálogo que aparece para localizar y seleccionar el archivo en el que desea guardar la versión delimitada por TAB.

source: A progress indicator is displayed while the file is exported as TAB delimited using Microsoft Excel standard settings (UTF-16LE character set , TAB as column separator and no text delimiters).
es: Se muestra un indicador de progreso mientras el archivo se exporta como delimitado por TAB utilizando la configuración estándar de Microsoft Excel ( juego de caracteres UTF-16LE, TAB como separador de columnas y sin delimitadores de texto).

source: Set File Level Metadata
es: Establecer Metadatos a Nivel de Archivo

source: The <header> element of a TMX document stores information about the file in three containers:
es: El elemento <header> de un documento TMX almacena información sobre el archivo en tres formatos:

source: Attributes
es: Atributos

source: Properties
es: Propiedades

source: Notes
es: Notas

source: To edit the metadata of the currently open TMX file, select File File Properties from the main menu or click on the File Properties button on the top toolbar.
es: Para editar los metadatos del archivo TMX actualmente abierto, seleccione Archivo Propiedades del Archivo en el menú principal o haga clic en el botón Propiedades del Archivo de la barra de herramientas superior.

source: File Properties Dialog
es: Cuadro de diálogo Propiedades del Archivo

source: File Level Attributes
es: Atributos a Nivel de Archivo

source: To change the file-level attributes of the TMX file, adjust the text displayed in the text boxes, select the appropriate values from the drop-down selectors, and then click the Save Attributes button.
es: Para cambiar los atributos a nivel de archivo del documento TMX, ajuste el texto que aparece en los cuadros de texto, seleccione los valores adecuados en los selectores desplegables y, a continuación, haga clic en el botón Guardar Atributos .

source: File Level Properties
es: Propiedades a Nivel de Archivo

source: To edit file-level properties, click on the Properties tab of the File Properties dialog. The dialog displays this view:
es: Para editar las propiedades a nivel de archivo, haga clic en la pestaña Propiedades del cuadro de diálogo Propiedades del Archivo . El diálogo muestra esta vista:

source: Click the Add Property button to open a dialog for entering the type and value of the new property to be added.
es: Haga clic en el botón Añadir Propiedad para abrir un cuadro de diálogo en el que introducir el tipo y el valor de la nueva propiedad que desea añadir.

source: If you want to remove properties from the list, click the corresponding Remove Property buttons ( ) on the leftmost column.
es: Si desea eliminar propiedades de la lista, haga clic en los correspondientes botones Eliminar Propiedad ( ) de la columna situada más a la izquierda.

source: Click the Save Properties button to save your changes.
es: Haga clic en el botón Guardar Propiedades para guardar los cambios.

source: File Level Notes
es: Notas a Nivel de Archivo

source: To edit file-level notes, click on the Notes tab of the File Properties dialog. The dialog displays this view:
es: Para editar notas a nivel de archivo, haga clic en la pestaña Notas del cuadro de diálogo Propiedades del Archivo . El diálogo muestra esta vista:

source: Click the Add Note button to open a dialog for entering the text of the new note to be added.
es: Haga clic en el botón Añadir Nota para abrir un cuadro de diálogo en el que podrá introducir el texto de la nueva nota que se agregará.

source: If you want to remove notes from the list, click the corresponding Remove Note buttons ( ) on the leftmost column.
es: Si desea eliminar notas de la lista, haga clic en los correspondientes botones Eliminar Nota ( ) de la columna situada más a la izquierda.

source: Click the Save Notes button to save your changes.
es: Haga clic en el botón Guardar Notas para guardar los cambios.

source: Follow these steps to filter units containing a given text or to display untranslated units.
es: Siga estos pasos para filtrar las unidades que contienen un texto determinado o para mostrar las unidades no traducidas.

source: In main menu, select View Filter Translation Units option ( [ F3 ]) or click the Filter Translation Units on the top toolbar.
es: En el menú principal, seleccione la opción Ver Filtrar Unidades de Traducción ([ F3 ]) o haga clic en el botón Filtrar Unidades de Traducción de la barra de herramientas superior.

source: Filter Translation Units Dialog
es: Cuadro de diálogo Filtrar Unidades de Traducción

source: Select what you want to filter:
es: Seleccione lo que desea filtrar:

source: To locate and highlight a given text in the TMX file:
es: Para localizar y resaltar un texto determinado en el archivo TMX:

source: Type the text that you want to find in the Text to Search text box.
es: Escriba el texto que desea encontrar en el cuadro de texto Texto a Buscar .

source: Use the Filter Language drop-down to select the language where the search will be performed.
es: Utilice la lista desplegable Idioma a Filtrar para seleccionar la columna de idioma donde se realizará la búsqueda.

source: Select the Regular Expression checkbox if you want to use regular expressions for specifying the text to search.
es: Active la casilla Expresión Regular si desea utilizar expresiones regulares para especificar el texto que se va a buscar

source: Check the Case Sensitive Search checkbox if you want to find only entries that match the case of the entered text.
es: Marque la casilla de verificación Diferenciar Mayúsculas y Minúsculas al Buscar si desea encontrar sólo entradas que coincidan con las mayúsculas y minúsculas del texto introducido.

source: To display untranslated units only:
es: Para mostrar solo unidades no traducidas:

source: Check the Show Untranslated Units Only checkbox.
es: Haga clic la casilla de verificación Mostrar Solo Unidades No Traducidas .

source: Use the Source Language drop-down to select the source language that will be used when filtering.
es: Use la lista desplegable Idioma Origen para seleccionar el idioma origen que será utilizado al filtrar.

source: Click the Apply Filters button.
es: Haga clic en el botón Aplicar Filtros .

source: Filtering options will remain active until you reopen the Filter Units dialog and click the Clear Filters button.
es: Las opciones de filtrado permanecerán activas hasta que vuelva a abrir el cuadro de diálogo Filtrar Unidades de Traducción y haga clic en el botón Borrar Filtros .

source: In main menu, select File Convert Excel File to TMX option or click the Convert Excel File to TMX button on the top toolbar.
es: En el menú principal, seleccione la opción Archivo Convertir Archivo Excel a TMX o haga clic en el botón Convertir Archivo Excel a TMX de la barra de herramientas superior.

source: Convert Excel File to TMX Dialog
es: Cuadro de diálogo Convertir Archivo Excel a TMX

source: Type the name of the Excel file to be converted in the Excel File text box or use the associated Browse... button to select a file from the system.
es: Escriba el nombre del archivo de Excel que se va a convertir en el cuadro de texto Archivo Excel o utilice el botón Examinar... asociado para seleccionar un archivo del sistema.

source: A preview of the the initial ten rows of the first worksheet is automatically loaded when you use the Browse... button:
es: Una vista previa de las diez filas iniciales de la primera hoja de cálculo se carga automáticamente cuando se utiliza el botón Examinar... :

source: Excel Preview Panel
es: Vista Previa de Excel

source: If you typed an Excel file name on the Excel File text box, click the Refresh Preview button to generate a preview.
es: Si escribió un nombre de archivo de Excel en el cuadro de texto Archivo Excel , haga clic en el botón Actualizar Vista Previa para generar una vista previa.

source: Type the name of the TMX file to generate in the TMX File text box or use the associated Browse... button to select a file name and location.
es: Escriba el nombre del archivo TMX a generar en el cuadro de texto Archivo TMX o utilice el botón Examinar... asociado para seleccionar un nombre de archivo y una ubicación.

source: Use the Sheet drop-down control to select the worksheet that you want to convert.
es: Use el control desplegable Hoja para seleccionar la hoja de cálculo que desea convertir.

source: Click the Set Languages button if language codes are not included in the file or you wish to change the automatically detected ones.
es: Haga clic en el botón Seleccionar Idiomas si los códigos de idioma no están incluidos en el archivo o si desea cambiar los detectados automáticamente.

source: Excel File Languages Dialog
es: Cuadro de diálogo Idiomas del Archivo Excel

source: Use the drop-down selectors to associate a language to each column. Click on the Set Languages button when finished.
es: Utilice los selectores desplegables para asociar un idioma a cada columna. Haga clic en el botón Seleccionar Idiomas cuando haya terminado.

source: The preview panel is updated to display selected languages for each column:
es: El panel de vista previa se actualiza para mostrar los idiomas seleccionados para cada columna:

source: Excel Preview Panel with Languages Selected
es: Panel de Vista Previa de Excel con Idiomas Seleccionados

source: Click the Convert Excel File to TMX button.
es: Haga clic en el botón Convertir Archivo Excel a TMX .

source: A TMX file containing all text from the Excel document is generated in the selected location.
es: Se genera un archivo TMX que contiene todo el texto del documento de Excel en la ubicación seleccionada.

source: In main menu, select File Convert SDLTM File to TMX option or click the Convert SDLTM File to TMX button on the top toolbar.
es: En el menú principal, seleccione la opción Archivo Convertir Archivo SDLTM a TMX o haga clic en el botón Convertir Archivo SDLTM a TMX de la barra de herramientas superior.

source: Convert SDLTM File to TMX Dialog
es: Cuadro de diálogo Convertir Archivo SDLTM a TMX

source: Type the name of the SDLTM file to be converted in the SDLTM File text box or use the associated Browse... button to select a file from the system.
es: Escriba el nombre del archivo SDLTM que se va a convertir en el cuadro de texto Archivo SDLTM o utilice el botón Examinar... asociado para seleccionar un archivo del sistema.

source: Click the Convert SDLTM File to TMX button.
es: Haga clic en el botón Convertir Archivo SDLTM a TMX .

source: Selected SDLTM file is converted to TMX and automatically opened in the editor if the Open Generated TMX File checkbox is selected.
es: El archivo SDLTM seleccionado se convierte a TMX y se abre automáticamente en el editor si la casilla de verificación Abrir Archivo TMX Generado está activada.

source: In main menu, select File Convert TBX File to TMX option or click the Convert TBX File to TMX button on the top toolbar.
es: En el menú principal, seleccione la opción Archivo Convertir Archivo TBX a TMX o haga clic en el botón Convertir Archivo TBX a TMX de la barra de herramientas superior.

source: Convert TBX File to TMX Dialog
es: Cuadro de diálogo Convertir Archivo TBX a TMX

source: Type the name of the TBX file to be converted in the TBX File text box or use the associated Browse... button to select a file from the system.
es: Escriba el nombre del archivo TBX que se va a convertir en el cuadro de texto Archivo TBX o utilice el botón Examinar... asociado para seleccionar un archivo del sistema.

source: Click the Convert TBX File to TMX button.
es: Haga clic en el botón Convertir Archivo TBX a TMX .

source: Selected TBX file is converted to TMX and automatically opened in the editor if the Open Generated TMX File checkbox is selected.
es: El archivo TBX seleccionado se convierte a TMX y se abre automáticamente en el editor si la casilla de verificación Abrir Archivo TMX Generado está activada.

source: Follow these steps to convert a CSV or TAB delimited file to TMX.
es: Siga estos pasos para convertir un archivo TMX a un archivo delimitad por TAB.

source: CSV (Comma Separated Values) are plain text files that contain text organized in tabular format, using commas to separate columns and quotes to delimit column content.
es: CSV (Comma Separated Values) son archivos de texto sin formato que contienen texto organizado en formato tabular, utilizando comas para separar las columnas y comillas para delimitar el contenido de las columnas.

source: TAB delimited files are similar to CSV, but using TAB characters to separate columns and usually without column delimiters.
es: Los archivos delimitados por TAB son similares a los CSV, pero utilizando caracteres TAB para separar las columnas y normalmente sin delimitadores de columna.

source: TMXEditor allows conversion to TMX of text files with different combinations of column separators and text delimiters.
es: TMXEditor permite convertir a TMX archivos de texto con distintas combinaciones de separadores de columnas y delimitadores de texto.

source: Text files exported from Microsoft Excel use these default settings:
es: Los archivos de texto exportados desde Microsoft Excel utilizan esta configuración por predeterminada:

source: Character Set: UTF-16LE
es: Juego de Caracteres: UTF-16LE

source: Column Separator: TAB
es: Separador de Columnas: TAB

source: Text Delimiter: none
es: Delimitador de Texto: ninguno

source: In main menu, select File Convert CSV/TAB Delimited File to TMX option or click the Convert CSV to TMX button on the top toolbar.
es: En el menú principal, seleccione la opción Archivo Convertir Archivo CSV/Texto Delimitado a TMX o haga clic en el botón Convertir Archivo CSV/Texto Delimitado a TMX de la barra de herramientas superior.

source: Convert CSV File to TMX Dialog
es: Cuadro de diálogo Convertir Archivo CSV a TMX

source: Type the name of the file to be converted in the CSV File text box or use the associated Browse... button to select a file from the system.
es: Escriba el nombre del archivo CSV que se va a convertir en el cuadro de texto Archivo CSV/Texto o utilice el botón Examinar... asociado para seleccionar un archivo del sistema.

source: Use the Character Set , Column Separator and Text Delimiter drop-down boxes to define the format of the file to be converted. Use the preview panel to check the correctness of the selected settings. Use Custom Separator and Custom Delimiter text boxes to enter values not included in the drop-down selectors.
es: Utilice las listas desplegables Juego de Caracteres , Separador de columnas y Delimitador dee Texto para definir el formato del archivo que se va a convertir. Utilice el panel de vista previa para comprobar que los ajustes seleccionados son correctos. Utilice los cuadros de texto Separador Personalizado y Delimitador Personalizado para introducir valores no incluidos en las listas desplegables.

source: On success, the preview panel displays the data in a tabular format. If language codes are included in the first row of the CSV file, they will be automatically detected and will also be displayed highlighted in the panel, as shown in this picture:
es: Si se realiza correctamente, el panel de vista previa muestra los datos en formato tabular. Si se incluyen códigos de idioma en la primera fila del archivo CSV, se detectarán automáticamente y también se mostrarán resaltados en el panel, como se muestra en esta imagen:

source: Correct Settings Example
es: Ejemplo de Configuración Correcta

source: Unexpected characters, like the ones shown in the picture below, indicate wrong character set selection.
es: Los caracteres inesperados, como los que se muestran en la imagen siguiente, indican una selección incorrecta del Juego de Caracteres .

source: Wrong Character Set Example
es: Ejemplo de Juego de Caracteres Equivocado

source: Readable text that is not displayed as a table, is a sign of incorrect selection of column separator or text delimiter. Use the preview panel to check the correct values.
es: El texto legible que no se muestra como una tabla es un signo de selección incorrecta del separador de columnas o del delimitador de texto. Utilice el panel de vista previa para comprobar los valores correctos.

source: Wrong Delimiters Example
es: Ejemplo de Delimitadores Equivocados

source: CSV/Text Languages Dialog
es: Cuadro de diálogo Idiomas del Archivo CSV/Texto

source: Use the drop-down controls in the CSV/Text Languages dialog to select the languages in the CSV file. Click the Set Languages button to confirm your selection.
es: Utilice las listas desplegables del cuadro de diálogo Idiomas del Archivo CSV/Texto para seleccionar los idiomas del archivo CSV. Haga clic en el botón Seleccionar Idiomas para confirmar su selección.

source: Check the Fix Excel Double Quotes box if the file was exported by Excel using double quote characters as text delimiter. This option ensures that quotes are not duplicated during conversion.
es: Active la casilla Corregir Comillas Dobles de Excel si Excel exportó el archivo con comillas dobles como delimitador de texto. Esta opción garantiza que las comillas no se dupliquen durante la conversión.

source: Check the Optional Text Delimiters box if the file does not use the selected text delimiter in all cases (some tools only surround text in delimiters when the de column separator is part of the exported text).
es: Marque la casilla Delimitadores de Texto Opcionales si el archivo no utiliza el delimitador de texto seleccionado en todos los casos (algunas herramientas solo rodean el texto en los delimitadores cuando el separador de columna forma parte del texto exportado).

source: Finally, click the Convert CSV to TMX button to generate the TMX file.
es: Finalmente, haga clic en el botón Convertir Archivo CSV a TMX para generar el archivo TMX.

source: The CSV file is converted to TMX and automatically opened in the editor if the Open Generated TMX File checkbox is selected.
es: El archivo CSV se convierte a TMX y se abre automáticamente en el editor si la casilla de verificación Abrir Archivo TMX Generado está activada.

source: Follow these steps to optimize a TMX file using a simplified dialog.
es: Siga estos pasos para optimizar un archivo TMX usando un cuadro de diálogo simplificado.

source: Maintenance Dashboard allows you to perform maintenance tasks in a simplified dialog that incorporates several actions available in Tasks menu.
es: El Panel de Mantenimiento le permite realizar tareas de mantenimiento en un cuadro de diálogo simplificado que incorpora varias acciones disponibles en el menú Tareas .

source: In main menu, select Tasks Maintenance Dashboard or click the Maintenance Dashboard button on the top toolbar.
es: En el menú principal, seleccione Tareas Panel de Mantenimiento o haga clic en el botón Panel de Mantenimiento de la barra de herramientas superior.

source: Maintenance Dashboard Dialog
es: Cuadro de diálogo Panel de Mantenimiento

source: Select the corresponding checkboxes for all tasks that you want to perform:
es: Seleccione las casillas de verificación correspondientes para todas las tareas que desee realizar:

source: Remove All Tags : remove all inline tags from the TMX file.
es: Eliminar Todas las Etiquetas : eliminar todas las etiquetas del archivo TMX.

source: Remove Duplicated Unis : remove duplicated translation units.
es: Eliminar Unidades Duplicadas : eliminar unidades de traducción duplicadas.

source: Remove Untranslated Units : remove all untranslated units.
es: Eliminar Unidades No Traducidas : eliminar todas las unidades no traducidas.
